

### **1. Автоматический парсер логов (поиск ошибок)**  
**Задача:**  
Есть файл `server.log`, в котором построчно записаны логи сервера. Нужно прочитать его и найти **первую строку с ошибкой** (содержащую `"ERROR"`), затем вывести её и завершить чтение.  

```python
with open("server.log", "r") as file:
    while True:
        line = file.readline()
        if not line:  # конец файла
            print("Ошибок не найдено")
            break
        if "ERROR" in line:
            print(f"Найдена ошибка: {line.strip()}")
            break
```

**Применение:**  
Анализ логов сервера для быстрого выявления сбоев.  

---

### **2. Брутфорс-проверка пароля (безопасность)**  
**Задача:**  
Есть зашифрованный архив, пароль к нему — **число от 1000 до 9999**. Напишите программу, которая перебирает все возможные комбинации, пока не найдет верный пароль (условно, пусть правильный пароль — `4242`).  

```python
correct_password = 4242
attempt = 1000

while attempt <= 9999:
    print(f"Проверяем: {attempt}")
    if attempt == correct_password:
        print(f"Пароль найден: {attempt}")
        break
    attempt += 1
else:
    print("Пароль не найден")
```

**Применение:**  
Тестирование устойчивости паролей к перебору (в учебных целях!).  

---

### **3. Чтение данных с датчика до превышения порога**  
**Задача:**  
Датчик температуры каждую секунду передает значение. Если температура **превышает 40°C**, нужно сработать сигнализацией (`print("ALARM!")`) и прекратить мониторинг.  

```python
import random
import time

while True:
    temperature = random.uniform(35, 45)  # имитация датчика
    print(f"Текущая температура: {temperature:.1f}°C")
    if temperature > 40:
        print("ALARM! Перегрев!")
        break
    time.sleep(1)  # задержка 1 сек
```

**Применение:**  
Мониторинг оборудования в реальном времени.  

---

### **4. Обработка транзакций до первой неудачной**  
**Задача:**  
Есть список транзакций `[True, True, False, True]`, где `True` — успешная транзакция, `False` — ошибка. Нужно обрабатывать их, пока не встретится **первая неудачная**.  

```python
transactions = [True, True, False, True]
index = 0

while index < len(transactions):
    if not transactions[index]:
        print(f"Транзакция {index + 1} не прошла. Прекращаем обработку.")
        break
    print(f"Транзакция {index + 1} успешна.")
    index += 1
```

**Применение:**  
Обработка платежей в банковских системах.  

---

### **5. Робот-уборщик (движение до препятствия)**  
**Задача:**  
Робот движется вперед, пока не обнаружит препятствие (условно, дистанция до препятствия `<= 0.5 м`). Данные с датчика поступают в реальном времени.  

```python
import random

distance = 10  # начальная дистанция в метрах
while True:
    print(f"Дистанция: {distance:.1f} м")
    if distance <= 0.5:
        print("Препятствие! Остановка.")
        break
    # Имитация движения (робот едет, дистанция уменьшается)
    distance -= random.uniform(0.1, 0.3)
    time.sleep(0.5)
```

**Применение:**  
Автоматизация робототехники (например, пылесосов).  

---

Эти задачи:  
- **Близки к реальным проектам** (логи, датчики, транзакции).  
- **Используют `while + break`** для контроля потока выполнения.  
- **Легко модифицируются** под конкретные условия.  

Попробуйте усложнить их: добавить обработку исключений, запись результатов в файл или интеграцию с API! 🛠️




__Задание 3.__ Проверка номера кредитки

Последняя цифра номера банковской карты (и некоторых других номеров карт и счетов) - это всегда контрольная сумма, которая считается по алгоритму Луна. 

Таким образом, если пользователь ошибётся в одной цифре или перепутает две цифры местами, то это легко вычислить на стороне терминала, не делая запрос в банк.

Пользователь вводит номер кредитной карты (16-значное целое число), а программа вычисляет и проверяет проверяет контрольную сумму, и говорит, валидный номер или нет. Алгоритм подсчёта суммы:

1. Цифры проверяемой последовательности нумеруются справа налево (Последняя цифра тоже считается, её номер - единица).
2. Цифры, оказавшиеся на нечётных местах, остаются без изменений.
3. Цифры, стоящие на чётных местах, умножаются на 2.
4. Если в результате такого умножения возникает число больше 9, оно заменяется суммой цифр получившегося произведения — однозначным числом, то есть цифрой.
5. Все полученные в результате преобразования цифры складываются. Если сумма кратна 10, то исходные данные верны.

*Примечание: Длина номера карты может не равняться 16 (дополнительные карты, экзотические платёжные системы и прочее). Также этот алгоритм часто парименяют, например, к номерам счетов и дисконтных карт. Поэтому лучше обобщить своё решение на произвольную длину номера*


Проверить списк карты на корректность


  Входные данные  |  Выходные данные
---------|-------
4274 9910 0017 1851 | Да
2202 2023 9427 7036 | Да
5019 5555 4444 5555 | Да
4034 5323 0294 8848 | Нет
6011 5564 4857 8945 8 | Нет
1234 5678 9123 4672 | Нет
5425 2334 3010 9903 | Да

